---
title: AssetPropertyString
classe: Autodesk.Revit.DB.Visual.AssetPropertyString
namespace: Autodesk.Revit.DB.Visual
eredita: Autodesk.Revit.DB.Visual.AssetProperty
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 2
---

# AssetPropertyString

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String Value { get; set; }` | `assetPropertyString.Value` | String |
| `Boolean IsValidValue(String)` | `assetPropertyString.IsValidValue(value)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```